app/controllers/posts_controller.rb

  def index #トップページを表示したい
    @posts = Post.all  # １番目のレコードを@postに代入
---
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`id` DESC

  def create
    Post.create(content: params[:content])
---
INSERT INTO `posts` (`content`, `created_at`, `updated_at`) VALUES ('投稿できねええええ', '2021-03-01 05:23:28.856595', '2021-03-01 05:23:28.856595')